In [41]:
import pandas as pd
import requests
from io import BytesIO
from sklearn.preprocessing import LabelEncoder

### 데이터 로드

In [2]:
# 로컬 csv 로드
local_csv = "C:/Users/송이두/Desktop/가천대/2-1/인공지능개론/과제/data/titanic.csv"
local_csv_data = pd.read_csv(local_csv)

In [3]:
# url csv 로드
url_csv = "https://raw.githubusercontent.com/MyungKyuYi/AI-class/refs/heads/main/titanic.csv"
url_csv_data = pd.read_csv(url_csv)

In [4]:
# 로컬 excel 로드
local_excel = "C:/Users/송이두/Desktop/가천대/2-1/인공지능개론/과제/data/combined_dataset-1.xlsx"
local_excel_data = pd.read_excel(local_excel)

In [5]:
# url excel 로드
url_excel = "https://raw.githubusercontent.com/MyungKyuYi/AI-class/main/combined_dataset-1.xlsx"
response = requests.get(url_excel)
excel_file = BytesIO(response.content)
url_excel_data = pd.read_excel(excel_file, engine='openpyxl')

In [7]:
url_csv_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 컬럼 drop

In [29]:
dropped_data = url_csv_data.drop(["PassengerId", "Name", "Ticket", "Embarked"], axis=1)

In [30]:
dropped_data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin
0         0       3    male  22.0      1      0   7.2500   NaN
1         1       1  female  38.0      1      0  71.2833   C85
2         1       3  female  26.0      0      0   7.9250   NaN
3         1       1  female  35.0      1      0  53.1000  C123
4         0       3    male  35.0      0      0   8.0500   NaN

### 인코딩

In [43]:
encoder = LabelEncoder()
dropped_data['Sex'] = encoder.fit_transform(dropped_data['Sex'])
dropped_data['Cabin'] = encoder.fit_transform(dropped_data['Cabin'])

In [44]:
dropped_data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Cabin
0         0       3    1  22.0      1      0   7.2500    147
1         1       1    0  38.0      1      0  71.2833     81
2         1       3    0  26.0      0      0   7.9250    147
3         1       1    0  35.0      1      0  53.1000     55
4         0       3    1  35.0      0      0   8.0500    147

### 결측치 처리

In [49]:
dropped_data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Cabin         0
dtype: int64

In [56]:
median_value = dropped_data['Age'].median()
dropped_data['Age'].fillna(median_value, inplace=True)

C:\Users\송이두\AppData\Local\Temp\ipykernel_2552\2362905481.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fillna_data = dropped_data['Age'].fillna(median_value, inplace=True)

In [57]:
dropped_data.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Cabin       0
dtype: int64